{"id":11,"date":"2014-06-12T21:31:07","date_gmt":"2014-06-12T21:31:07","guid":{"rendered":"https:\/\/s-g-lawyers.com\/?page_id=11"},"modified":"2017-01-03T16:53:30","modified_gmt":"2017-01-03T16:53:30","slug":"practice-areas","status":"publish","type":"page","link":"https:\/\/s-g-lawyers.com\/practice-areas\/","title":{"rendered":"Spectrum Legal Group, LLP: Practice Areas"},"content":{"rendered":"<p><code><h2 class=\"collapseomatic \" id=\"id604682994b1b2\"  tabindex=\"\" title=\"<\/code>Business &amp; Corporate Law<code>\"    ><\/code>Business &amp; Corporate Law<code><\/h2><div id=\"target-id604682994b1b2\" class=\"collapseomatic_content \"><\/code><\/p>\n<p><span style=\"text-decoration: underline;\">Formation<\/span>: Assisting clients in entity selection, formation, and structure is a core function of our business and corporate services. Our attorneys have represented companies from start-ups to national and international companies by providing advice about which entity to choose, where to form the entities, developing corporate structure from the simple to the complex, and forming the entity.<\/p>\n<p><span style=\"text-decoration: underline;\">Contracts<\/span>: An essential part of our business and corporate services is preparing a wide variety of contracts to facilitate business transactions. Our attorneys serve our corporate and business clients by drafting, reviewing, advising, and negotiating business contracts with suppliers and with purchasers; contracts involving the purchase and sale of equipment, land, and other specific assets; acquisition, merger, and sale of businesses; contracts involving business, workplace, and employment and safety issues; and licenses and assignments of intellectual property among other agreements.<\/p>\n<p><span style=\"text-decoration: underline;\">Disputes<\/span>: We are also prepared to settle disputes, as well as mediate, arbitrate or litigate breaches of contract, and matters that cannot be resolved otherwise. Members of our firm bring over thirty years of business litigation experience.<\/p>\n<\/div>\n<p><code><h2 class=\"collapseomatic \" id=\"id604682994b23e\"  tabindex=\"\" title=\"<\/code>Employment &amp; Workplace Safety Law<code>\"    ><\/code>Employment &amp; Workplace Safety Law<code><\/h2><div id=\"target-id604682994b23e\" class=\"collapseomatic_content \"><\/code><\/p>\n<p><span style=\"text-decoration: underline;\">Employment<\/span>: Our employment practice is supported by decades of experience. Our attorneys represent very diverse industries. Our clients look to us for assistance in answering day to day questions involving all areas involving employees and employer relations. Our goal is to assist our clients in the minimization of risk and exposure inherent in many employment decisions and to assist clients in the development of personnel and safety policies and programs which will achieve their business goals. We perform workplace audits and training in compliance with employment and safety laws.<\/p>\n<p><span style=\"text-decoration: underline;\">Disputes<\/span>: We have experience litigating discrimination and harassment claims, wage\/hour claims and breach of contract claims. We represent and defend clients in the courts, in arbitration, in mediation and involving enforcement agencies in a variety of areas of employment law such as the Equal Employment Opportunity Commission, US and various state Departments of Labor, Wyoming Department of Workforce Services, Colorado Division of Civil Rights and local agencies with specific workplace rules and regulations.<\/p>\n<\/div>\n<p><code><h2 class=\"collapseomatic \" id=\"id604682994b2bc\"  tabindex=\"\" title=\"<\/code>Oil, Gas &amp; Energy Law<code>\"    ><\/code>Oil, Gas &amp; Energy Law<code><\/h2><div id=\"target-id604682994b2bc\" class=\"collapseomatic_content \"><\/code><\/p>\n<p>Our Oil, Gas and Energy Division serves clients who develop energy-related assets. These clients often find benefit from the availability of the firm’s other workgroups as they encounter corporate, employment, intellectual property, and litigation services similar to any other business not involved in energy.<\/p>\n<p><span style=\"text-decoration: underline;\">Title and Due Diligence<\/span>: Our attorneys have drafted more than one hundred fifty (150) title opinions covering the Greater Wattenburg and Denver-Julesburg Basins, the Bakken and Three Forks area of North Dakota, the Uinta Basin in Utah, federal lands, and lands in Texas and Wyoming. These opinions include Drilling Opinions, Division Order Opinions, Drilling and Division Order Opinions, Acquisition Opinions, and Supplemental Opinions. We draft curative documents, including stipulations of interests conveyance and correction deeds, and we provide local and ancillary probate document drafting and assistance. We assist clients in obtaining production funds from suspense accounts and assist other clients in deciding whether or not to suspend distribution of such proceeds. In connection with title and curative work, we offer title due diligence and other due diligence for transactions large and small.<\/p>\n<p><span style=\"text-decoration: underline;\">Contracts<\/span>: Our attorneys have extensive experience in the drafting of master service agreements for transportation and drilling contracts and in the negotiation of drilling contracts, including the IADC 2003 and now the IADC 2013 version. We review and provide guidance on operating agreements, exploration and development agreements, purchase and sale agreements, licenses, assignments and joint venture agreements.<\/p>\n<p><span style=\"text-decoration: underline;\">Commission Work<\/span>: We assist in interpreting correspondence between landowners and businesses with regard to force pooling and other possible actions, some of which may be heard by the Colorado Oil and Gas Commission, North Dakota Industrial Commission, or Wyoming Oil and Gas Conservation Commission. We are able to appear before these bodies to adjudicate rights involving participation, spacing units, and pooling actions, among other things.<\/p>\n<p><span style=\"text-decoration: underline;\">Workplace Safety<\/span>: Our attorneys have a specialty certification from the OSHA Training Institute in Oil &amp; Gas workplace safety issues. We use this knowledge to assist our clients in the prevention of OSHA violations and the related fines and the preparation of and review of safety manuals. This certification and our related experience provides us with the unique advantage of preparing for litigation oversight and preparation of witnesses and lawyers in the unlikely but occasional workplace accident.<\/p>\n<\/div>\n<p><code><h2 class=\"collapseomatic \" id=\"id604682994b321\"  tabindex=\"\" title=\"<\/code>Trusts &amp; Estates<code>\"    ><\/code>Trusts &amp; Estates<code><\/h2><div id=\"target-id604682994b321\" class=\"collapseomatic_content \"><\/code><\/p>\n<p>Our firm’s trust and estate practice includes a broad range of matters, from preparation of simple wills, general or limited powers of attorney, medical power of attorney and other related estate planning documentation. The firm also has experience in probating documents related to in-state lands on behalf of in-state or out-of-state clients, and interpreting wills and other estate documents for trust and estate administration and oversight.<\/p>\n<\/div>\n<p><code><h2 class=\"collapseomatic \" id=\"id604682994b37c\"  tabindex=\"\" title=\"<\/code>Insurance Related Matters<code>\"    ><\/code>Insurance Related Matters<code><\/h2><div id=\"target-id604682994b37c\" class=\"collapseomatic_content \"><\/code><\/p>\n<p>We litigate, offer litigation support and provide supervision of other counsel engaged by a company in many different matters, whether in-house or through another firm regardless of whether insurance defense counsel is currently on the case or not.<\/p>\n<p>Our lawyers have extensive litigation and litigation oversight experience and a specialty certification from the OSHA Training Institute in Oil &amp; Gas in workplace safety issues.<\/p>\n<p>This certification and our related experience provide us with the unique advantage of preparing for litigation oversight and preparation of witnesses and lawyers in the unlikely, but occasional workplace accident.<\/p>\n<\/div>\n","protected":false},"excerpt":{"rendered":"","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":2,"comment_status":"open","ping_status":"open","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/s-g-lawyers.com\/wp-json\/wp\/v2\/pages\/11"}],"collection":[{"href":"https:\/\/s-g-lawyers.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/s-g-lawyers.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/s-g-lawyers.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/s-g-lawyers.com\/wp-json\/wp\/v2\/comments?post=11"}],"version-history":[{"count":32,"href":"https:\/\/s-g-lawyers.com\/wp-json\/wp\/v2\/pages\/11\/revisions"}],"predecessor-version":[{"id":232,"href":"https:\/\/s-g-lawyers.com\/wp-json\/wp\/v2\/pages\/11\/revisions\/232"}],"wp:attachment":[{"href":"https:\/\/s-g-lawyers.com\/wp-json\/wp\/v2\/media?parent=11"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}